#### Exercise 1
##### Using the data in the `2019_Yellow_Taxi_Trip_Data.csv` file, calculate summary statistics for the `fare_amount`, `tip_amount`, `tolls_amount`, and `total_amount` columns.

In [3]:
import pandas as pd

In [12]:
df = pd.read_csv("data/2019_Yellow_Taxi_Trip_Data.csv")

df.head()

,vendorid,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,ratecodeid,store_and_fwd_flag,pulocationid,dolocationid,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge
0,2,2019-10-23T16:39:42.000,2019-10-23T17:14:10.000,1,7.93,1,N,138,170,1,29.5,1.0,0.5,7.98,6.12,0.3,47.90,2.5
1,1,2019-10-23T16:32:08.000,2019-10-23T16:45:26.000,1,2.00,1,N,11,26,1,10.5,1.0,0.5,0.00,0.00,0.3,12.30,0.0
2,2,2019-10-23T16:08:44.000,2019-10-23T16:21:11.000,1,1.36,1,N,163,162,1,9.5,1.0,0.5,2.00,0.00,0.3,15.80,2.5
3,2,2019-10-23T16:22:44.000,2019-10-23T16:43:26.000,1,1.00,1,N,170,163,1,13.0,1.0,0.5,4.32,0.00,0.3,21.62,2.5
4,2,2019-10-23T16:45:11.000,2019-10-23T16:58:49.000,1,1.96,1,N,163,236,1,10.5,1.0,0.5,0.50,0.00,0.3,15.30,2.5

In [17]:
print("min = ", df["fare_amount"].min())
print("mean = ",df["fare_amount"].mean())
print("mean = ",df["fare_amount"].median())
print("min = ", df["fare_amount"].max())

min =  -52.0
mean =  15.106313
mean =  10.0
min =  176.0

In [18]:
print("min = ", df["tip_amount"].min())
print("mean = ",df["tip_amount"].mean())
print("mean = ",df["tip_amount"].median())
print("min = ", df["tip_amount"].max())

min =  0.0
mean =  2.6344939999999997
mean =  2.0
min =  43.0

In [19]:
print("min = ", df["tolls_amount"].min())
print("mean = ",df["tolls_amount"].mean())
print("mean = ",df["tolls_amount"].median())
print("min = ", df["tolls_amount"].max())

min =  -6.12
mean =  0.623447
mean =  0.0
min =  612.0

In [20]:
print("min = ", df["total_amount"].min())
print("mean = ",df["total_amount"].mean())
print("mean = ",df["total_amount"].median())
print("min = ", df["total_amount"].max())

min =  -65.92
mean =  22.564659
mean =  16.3
min =  671.8

#### Exercise 2
##### Isolate the `fare_amount`, `tip_amount`, `tolls_amount`, and `total_amount` for the longest trip by distance (`trip_distance`).

In [23]:
df.loc[df["trip_distance"].idxmax(), ["fare_amount","tip_amount","tolls_amount","total_amount"]]

fare_amount      176.0
tip_amount       18.29
tolls_amount      6.12
total_amount    201.21
Name: 8338, dtype: object

#### Exercise 3
##### Read in the meteorite data from the `Meteorite_Landings.csv` file, rename the `mass (g)` column to `mass`, and drop all the latitude and longitude columns. Sort the result by mass in descending order.

#### Exercise 4
##### Using the meteorite data from the `Meteorite_Landings.csv` file, update the `year` column to only contain the year, convert it to a numeric data type, and create a new column indicating whether the meteorite was observed falling before 1970. Set the index to the `id` column and extract all the rows with IDs between 10,036 and 10,040 (inclusive) with `loc[]`.

###### **Hint 1**: Use `year.str.slice()` to grab a substring.

###### **Hint 2**: Make sure to sort the index before using `loc[]` to select the range.

###### **Bonus**: There's a data entry error in the `year` column. Can you find it? (Don't spend too much time on this.)

In [28]:
df1 = pd.read_csv("data/Meteorite_Landings.csv")

df1.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [35]:
df1['year'] = pd.to_datetime(df1['year'], errors='coerce')

df1 = df1.dropna(subset=['year'])

df1['year'] = pd.to_datetime(df1['year']).dt.year

df1['isBefore1970'] = df1['year'] < 1970

df1.head()

,name,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation,isBefore1970
id,,,,,,,,,,
1,Aachen,Valid,L5,21.0,Fell,1970,50.77500,6.08333,"(50.775, 6.08333)",False
2,Aarhus,Valid,H6,720.0,Fell,1970,56.18333,10.23333,"(56.18333, 10.23333)",False
4,Abajo,Valid,H5,331.0,Found,1970,26.80000,-105.41667,"(26.8, -105.41667)",False
5,Abbott,Valid,H3-6,21100.0,Found,1970,36.30000,-104.28333,"(36.3, -104.28333)",False
6,Abee,Valid,EH4,107000.0,Fell,1970,54.21667,-113.00000,"(54.21667, -113.0)",False

In [36]:
df1.set_index('id', inplace=True)

df1.sort_index(inplace=True)

filtered_rows = df1.loc[10036:10040]

print(filtered_rows)

KeyError: "None of ['id'] are in the columns"

#### Exercise 5
##### Using the taxi trip data in the `2019_Yellow_Taxi_Trip_Data.csv` file, resample the data to an hourly frequency based on the dropoff time. Calculate the total `trip_distance`, `fare_amount`, `tolls_amount`, and `tip_amount`, then find the 5 hours with the most tips.

#### Exercise 6
##### Using the TSA traveler throughput data in the `tsa_melted_holiday_travel.csv` file, create box plots for traveler throughput for each year in the data. Hint: Pass `kind='box'` into the `plot()` method to generate box plots.

#### Exercise 7
##### Using the TSA traveler throughput data in the `tsa_melted_holiday_travel.csv` file, create a heatmap that shows the 2019 TSA median traveler throughput by day of week and month.